package main

import (
	"testing"
)

func TestComputer(t *testing.T) {
	want := []struct {
		want string
		num  int
	}{
		{"1 компьютер", 1},
		{"2 компьютера", 2},
		{"3 компьютера", 3},
		{"4 компьютера", 4},
		{"5 компьютеров", 5},
		{"6 компьютеров", 6},
		{"7 компьютеров", 7},
		{"8 компьютеров", 8},
		{"9 компьютеров", 9},
		{"10 компьютеров", 10},
		{"11 компьютеров", 11},
		{"12 компьютеров", 12},
		{"13 компьютеров", 13},
		{"14 компьютеров", 14},
		{"15 компьютеров", 15},
		{"16 компьютеров", 16},
		{"17 компьютеров", 17},
		{"18 компьютеров", 18},
		{"19 компьютеров", 19},
		{"20 компьютеров", 20},
		{"21 компьютер", 21},
		{"22 компьютера", 22},
		{"23 компьютера", 23},
		{"24 компьютера", 24},
		{"25 компьютеров", 25},
		{"26 компьютеров", 26},
		{"27 компьютеров", 27},
		{"28 компьютеров", 28},
		{"29 компьютеров", 29},
		{"30 компьютеров", 30},
	}

	for _, v := range want {
		got := Computer(v.num)
		if got != v.want {
			t.Errorf("want %s got %s", got, v.want)
		}
	}
}
